package com.example.feature.prayer.domain.model

data class City(
    val name: String,
    val country: String,
    val lat: Double,
    val lng: Double
)

object CityProvider {
    val cities = listOf(
        City("حلب", "سوريا", 36.2021, 37.1343),
        City("دمشق", "سوريا", 33.5138, 36.2765),
        City("حمص", "سوريا", 34.7324, 36.7137),
        City("حماة", "سوريا", 35.1318, 36.7578),
        City("اللاذقية", "سوريا", 35.5312, 35.7879),
        City("إدلب", "سوريا", 35.9306, 36.6339),
        City("طرطوس", "سوريا", 34.8890, 35.8866),
        City("درعا", "سوريا", 32.6208, 36.1030),
        City("عمان", "الأردن", 31.9454, 35.9284),
        City("القدس", "فلسطين", 31.7683, 35.2137),
        City("مكة المكرمة", "السعودية", 21.4225, 39.8262),
        City("المدينة المنورة", "السعودية", 24.4672, 39.6068),
        City("إسطنبول", "تركيا", 41.0082, 28.9784),
        City("القاهرة", "مصر", 30.0444, 31.2357)
    )
}
